rt/databinding/aegis/src/test/java/org/apache/cxf/aegis/type/basic/EchoData.xml

<?xml version="1.0"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Header/>
    <env:Body>
        <echoData xmlns="http://services.aegis.cxf.apache.org">
            <bean>
                <data/>
                <moreData/>
            </bean>
        </echoData>
    </env:Body>
</env:Envelope>
